// Напишите программу, которая будет выдавать
//Название дня ненедели по заданному номеру

string dayWeek = Console.ReadLine();
if(dayWeek == "1") Console.WriteLine("Понеденик");
else if(dayWeek == "1") Console.WriteLine("Понеденик");
else Console.WriteLine("Ошибка ввода!");